@l313l.ar_cmd(
    pattern="(بصمات2)$",
    command=("بصمات2", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الثاني",
        "الاستـخـدام": "{tr}بصمات2",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.ثقفو`  
`.جبتك لحاله`  
`.ارجع للمطبخ`  
`.شلونكم`  
`.ليش`  
`.تعذرني`  
`.لا شكرا`  
`.باي حبيبي`  
`.غير مره`  
`.اكره ليرد متاخر`  
`.اكلك`  
`.عزه العزاك`  
`.جنك ماعاجبك`  
`.شكد سخيف`  
`.انت مطي`  
`.شكد تحمه`  
`.شكد فكر`  
`.شكد لطير`  
`.شكد فاهي`  
`.شكد غبي`  
`.شنو اسمج`  
`.شكرا`  
`.هلو كرار`  
`.امحح`  
`.كافي`  
`.ماتاكل خره`  
`.ايع`  
`.وي`  
`.انجب`  
`.فهمت لو لا`  
`.عادي`  
`.امحححح`  
`.هلو ابراهيم`  
`.هلو حيدر`  
`.هلو رضا`  
`.هلو مرتضى`  
`.هلو عمر`  
`.اخوي جفت`  
`.والله تمام`  

╰───────⌯───────╯
        """
    )
