from JoKeRUB import l313l
from ..core.managers import edit_or_reply

plugin_category = "بصمات البنات"

@l313l.ar_cmd(
    pattern="(بصمات)$",
    command=("بصمات", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الأول",
        "الاستـخـدام": "{tr}بصمات",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.هلا`  
`.شلخبار`  
`.شلونك`  
`.شلونج`  
`.نتعرف`  
`.اني معجبه`  
`.عجبني اراسلك`  
`.نرتبط`  
`.نتزوج`  
`.ترا حبيتك`  
`.هلكد ثكيل`  
`.دز رصيد`  
`.غنيله`  
`.اريد رصيد`  
`.ارشقلي`  
`.ارشق قناتي`  
`.ارشقلي حسابي`  
`.سويلي تمويل`  
`.دز صورتك`  
`.دز ببجي`  
`.دز لودو`  
`.حساب انستا`  
`.حساب تيك`  
`.الو`  
`.وينك`  
`.وينج`  
`.اي`  
`.لا`  
`.اكل خره`  
`.اكلي خره`  
`.يله`  
`.شبيك`  
`.شبيج`  
`.احبج`  
`.احبك`  
`.تحبني`  
`.انطي بوسه`  
`.ابوسك`  
`.احضنك`  
`.اريدك بس الي`  
`.ماكدر تصال`  
`.ماحب لتصال`  
`.هاي احسن`  
`.يلا لتلح`  
`.لا تلحين`  
`.امداك`  
`.امداج`  
`.تمام`  
`.هلو محمد`  
`.باي`  
`.مابيه شي`  
`.شنو`  
`.كول`  
`.اكلج`  
`.كولي`  
`.مبي شحن`  
`.من بغداد`  
`.من الكوت`  
`.من لعماره`  
`.من الناصريه`  
`.من البصره`  
`.من الديوانيه`  
`.من الحله`  
`.من السماوه`  
`.من كربلاء`  
`.من النجف`  
`.من دبالى`  
`.من صلاح الدين`  
`.من كركوك`  
`.من الموصل`  
`.من سليمانيه`  
`.من دهوك`  
`.من اربيل`  
`.فعلي مميز`  
`.بوسهه`  
`.دز شدات`  
`.عرفني عليك`  
`.وانته`  
`.ها`  
`.شتريد`  
`.اني بنيه`  
`.اني بنيه لج`  
`.17`  
`.18`  
`.20`  
`.21`  
`.22`  
`.ها كبينه`  
`.وين مختفي`

╰───────⌯───────╯
        """
    )
