@l313l.ar_cmd(
    pattern="(بصمات3)$",
    command=("بصمات3", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الثالث",
        "الاستـخـدام": "{tr}بصمات3",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.بخير تمام`  
`.الو السلام`  
`.انته طيري`  
`.وسام احبك`  
`.هلو سجاد`  
`.هلو باقر`  
`.هلو زيد`  
`.شدتسوي`  
`.ليش زعلت`  
`.شكد عمرك`  
`.شكد تحبني`  
`.ضفي النيه`  
`.ضحكه`  
`.شتريد يسولفون`  
`.بنيه تره`  
`.لتصير تافه`  
`.هلو عبد`  
`.هلو علي`  
`.هلو حسون`  
`.هلو حسين`  
`.هلو مصطفى`  
`.هلو احمد`  
`.شوف اغار`  
`.اغار عليك`  
`.غزل`  
`.وصخ`  
`.دي`  
`.اتسرسح`  
`.تحبيني`  
`.اموت عليك`  
`.ماريد اغلط`  
`.ماريد اهينك`  
`.ماريد اهينج`  
`.انجب`  
`.انجبي`  
`.انت المالك`  
`.ارفعني`  
`.تصبحون على خير`  
`.اجت فكره`  
`.تموت عل بنات`  
`.هلو مسلم`  
`.السلام`  
`.ممكن نتعرف`  
`.هاي انته`  
`.من وين`  
`.اشكد عمرك`  
`.انت مرتبط`  
`.من امت مرتبط`

╰───────⌯───────╯
        """
    )
