@l313l.ar_cmd(
    pattern="(بصمات2)$",
    command=("بصمات2", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الثاني",
        "الاستـخـدام": "{tr}بصمات2",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.ثقفو`  
`.جبتك لحاله`  
`.ارجع للمطبخ`  
`.شلونكم`  
`.ليش`  
`.تعذرني`  
`.لا شكرا`  
`.باي حبيبي`  
`.غير مره`  
`.اكره ليرد متاخر`  
`.اكلك`  
`.عزه العزاك`  
`.جنك ماعاجبك`  
`.شكد سخيف`  
`.انت مطي`  
`.شكد تحمه`  
`.شكد فكر`  
`.شكد لطير`  
`.شكد فاهي`  
`.شكد غبي`  
`.شنو اسمج`  
`.شكرا`  
`.هلو كرار`  
`.امحح`  
`.كافي`  
`.ماتاكل خره`  
`.ايع`  
`.وي`  
`.انجب`  
`.فهمت لو لا`  
`.عادي`  
`.امحححح`  
`.هلو ابراهيم`  
`.هلو حيدر`  
`.هلو رضا`  
`.هلو مرتضى`  
`.هلو عمر`  
`.اخوي جفت`  
`.والله تمام`  

╰───────⌯───────╯
        """
    )


@l313l.ar_cmd(
    pattern="(بصمات2)$",
    command=("بصمات2", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الثاني",
        "الاستـخـدام": "{tr}بصمات2",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.ثقفو`  
`.جبتك لحاله`  
`.ارجع للمطبخ`  
`.شلونكم`  
`.ليش`  
`.تعذرني`  
`.لا شكرا`  
`.باي حبيبي`  
`.غير مره`  
`.اكره ليرد متاخر`  
`.اكلك`  
`.عزه العزاك`  
`.جنك ماعاجبك`  
`.شكد سخيف`  
`.انت مطي`  
`.شكد تحمه`  
`.شكد فكر`  
`.شكد لطير`  
`.شكد فاهي`  
`.شكد غبي`  
`.شنو اسمج`  
`.شكرا`  
`.هلو كرار`  
`.امحح`  
`.كافي`  
`.ماتاكل خره`  
`.ايع`  
`.وي`  
`.انجب`  
`.فهمت لو لا`  
`.عادي`  
`.امحححح`  
`.هلو ابراهيم`  
`.هلو حيدر`  
`.هلو رضا`  
`.هلو مرتضى`  
`.هلو عمر`  
`.اخوي جفت`  
`.والله تمام`  

╰───────⌯───────╯
        """
    )



@l313l.ar_cmd(
    pattern="(بصمات3)$",
    command=("بصمات3", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء الثالث",
        "الاستـخـدام": "{tr}بصمات3",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.بخير تمام`  
`.الو السلام`  
`.انته طيري`  
`.وسام احبك`  
`.هلو سجاد`  
`.هلو باقر`  
`.هلو زيد`  
`.شدتسوي`  
`.ليش زعلت`  
`.شكد عمرك`  
`.شكد تحبني`  
`.ضفي النيه`  
`.ضحكه`  
`.شتريد يسولفون`  
`.بنيه تره`  
`.لتصير تافه`  
`.هلو عبد`  
`.هلو علي`  
`.هلو حسون`  
`.هلو حسين`  
`.هلو مصطفى`  
`.هلو احمد`  
`.شوف اغار`  
`.اغار عليك`  
`.غزل`  
`.وصخ`  
`.دي`  
`.اتسرسح`  
`.تحبيني`  
`.اموت عليك`  
`.ماريد اغلط`  
`.ماريد اهينك`  
`.ماريد اهينج`  
`.انجب`  
`.انجبي`  
`.انت المالك`  
`.ارفعني`  
`.تصبحون على خير`  
`.اجت فكره`  
`.تموت عل بنات`  
`.هلو مسلم`  
`.السلام`  
`.ممكن نتعرف`  
`.هاي انته`  
`.من وين`  
`.اشكد عمرك`  
`.انت مرتبط`  
`.من امت مرتبط`

╰───────⌯───────╯
        """
    )
