from JoKeRUB import l313l
from ..core.managers import edit_or_reply


plugin_category = "بصمات البنات"

@l313l.ar_cmd(
    pattern="(بصمات1)$",
    command=("بصمات1", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 1",
        "الاستـخـدام": "{tr}بصمات1",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.هلا`  `.شلخبار`  `.شلونك`  `.شلونج`  `.نتعرف`  `.اني معجبه`  `.عجبني اراسلك`  `.نرتبط`  `.نتزوج`  `.ترا حبيتك`
`.هلكد ثكيل`  `.دز رصيد`  `.غنيله`  `.اريد رصيد`  `.ارشقلي`  `.ارشق قناتي`  `.ارشقلي حسابي`  `.سويلي تمويل`
`.دز صورتك`  `.دز ببجي`  `.دز لودو`  `.حساب انستا`  `.حساب تيك`  `.الو`  `.وينك`  `.وينج`  `.اي`  `.لا`
`.اكل خره`  `.اكلي خره`  `.يله`  `.شبيك`  `.شبيج`  `.احبج`  `.احبك`  `.تحبني`  `.انطي بوسه`  `.ابوسك`
`.احضنك`  `.اريدك بس الي`  `.ماكدر تصال`  `.ماحب لتصال`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات2)$",
    command=("بصمات2", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 2",
        "الاستـخـدام": "{tr}بصمات2",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.هاي احسن`  `.يلا لتلح`  `.لا تلحين`  `.امداك`  `.امداج`  `.تمام`  `.هلو محمد`  `.باي`  `.مابيه شي`
`.شنو`  `.كول`  `.اكلج`  `.كولي`  `.مبي شحن`  `.من بغداد`  `.من الكوت`  `.من لعماره`  `.من الناصريه`  `.من البصره`
`.من الديوانيه`  `.من الحله`  `.من السماوه`  `.من كربلاء`  `.من النجف`  `.من دبالى`  `.من صلاح الدين`  `.من كركوك`
`.من الموصل`  `.من سليمانيه`  `.من دهوك`  `.من اربيل`  `.فعلي مميز`  `.بوسهه`  `.دز شدات`  `.عرفني عليك`
`.وانته`  `.ها`  `.شتريد`  `.اني بنيه`  `.اني بنيه لج`  `.17`  `.18`  `.20`  `.21`  `.22`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات3)$",
    command=("بصمات3", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 3",
        "الاستـخـدام": "{tr}بصمات3",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.ثقفو`  `.جبتك لحاله`  `.ارجع للمطبخ`  `.شلونكم`  `.ليش`  `.تعذرني`  `.لا شكرا`  `.باي حبيبي`  `.غير مره`
`.اكره ليرد متاخر`  `.اكلك`  `.عزه العزاك`  `.جنك ماعاجبك`  `.شكد سخيف`  `.انت مطي`  `.شكد تحمه`  `.شكد فكر`
`.شكد لطير`  `.شكد فاهي`  `.شكد غبي`  `.شنو اسمج`  `.شكرا`  `.هلو كرار`  `.امحح`  `.كافي`  `.ماتاكل خره`
`.ايع`  `.وي`  `.انجب`  `.فهمت لو لا`  `.عادي`  `.امحححح`  `.هلو ابراهيم`  `.هلو حيدر`  `.هلو رضا`
`.هلو مرتضى`  `.هلو عمر`  `.اخوي جفت`  `.والله تمام`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات4)$",
    command=("بصمات4", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 4",
        "الاستـخـدام": "{tr}بصمات4",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.بخير تمام`  `.الو السلام`  `.انته طيري`  `.وسام احبك`  `.هلو سجاد`  `.هلو باقر`  `.هلو زيد`  `.شدتسوي`
`.ليش زعلت`  `.شكد عمرك`  `.شكد تحبني`  `.ضفي النيه`  `.ضحكه`  `.شتريد يسولفون`  `.بنيه تره`  `.لتصير تافه`
`.هلو عبد`  `.هلو علي`  `.هلو حسون`  `.هلو حسين`  `.هلو مصطفى`  `.هلو احمد`  `.شوف اغار`  `.اغار عليك`  `.غزل`
`.وصخ`  `.دي`  `.اتسرسح`  `.تحبيني`  `.اموت عليك`  `.ماريد اغلط`  `.ماريد اهينك`  `.ماريد اهينج`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات5)$",
    command=("بصمات5", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 5",
        "الاستـخـدام": "{tr}بصمات5",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.انجب`  `.انجبي`  `.انت المالك`  `.ارفعني`  `.تصبحون على خير`  `.اجت فكره`  `.تموت عل بنات`  `.هلو مسلم`
`.السلام`  `.ممكن نتعرف`  `.هاي انته`  `.من وين`  `.اشكد عمرك`  `.انت مرتبط`  `.من امت مرتبط`  `.ها كبينه`
`.وين مختفي`  `.اكعد راحه`  `.بعدني احبك`  `.عيوني الك`  `.كافي بطل`  `.مو كد كلامك`  `.حبيتك هواي`
`.صارلي احبك`  `.راح احذفك`  `.انته ميت`  `.ليش تغيرت`  `.ذبتني`  `.كلتلك احبك`  `.لا تخليني`
`.رد عل خاص`  `.لاتشوف غيري`  `.كلشي من وراك`  `.انته حظي`  `.هواي تعبت`
╰───────⌯───────╯
        """
    )
