from JoKeRUB import l313l
from ..core.managers import edit_or_reply

plugin_category = "بصمات البنات"

@l313l.ar_cmd(
    pattern="(بصمات|بصمات بنات|بصمات بنات السورس)$",
    command=("بصمات", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس",
        "الاستـخـدام": "{tr}بصمات أو {tr}بصمات بنات أو {tr}بصمات بنات السورس",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`.هلا`  
`.شلخبار`  
`.شلونك`  
`.شلونج`  
`.نتعرف`  
`.اني معجبه`  
`.عجبني اراسلك`  
`.نرتبط`  
`.نتزوج`  
`.ترا حبيتك`  
`.هلكد ثكيل`  
`.دز رصيد`  
`.غنيله`  
`.اريد رصيد`  
`.ارشقلي`  
`.ارشق قناتي`  
`.ارشقلي حسابي`  
`.سويلي تمويل`  
`.دز صورتك`  
`.دز ببجي`  
`.دز لودو`  
`.حساب انستا`  
`.حساب تيك`  
`.الو`  
`.وينك`  
`.وينج`  
`.اي`  
`.لا`  
`.اكل خره`  
`.اكلي خره`  
`.يله`  
`.شبيك`  
`.شبيج`  
`.احبج`  
`.احبك`  
`.تحبني`  
`.انطي بوسه`  
`.ابوسك`  
`.احضنك`  
`.اريدك بس الي`  
`.ماكدر تصال`  
`.ماحب لتصال`  
`.هاي احسن`  
`.يلا لتلح`  
`.لا تلحين`  
`.امداك`  
`.امداج`  
`.تمام`  
`.هلو محمد`  
`.باي`  
`.مابيه شي`  
`.شنو`  
`.كول`  
`.اكلج`  
`.كولي`  
`.مبي شحن`  
`.من بغداد`  
`.من الكوت`  
`.من لعماره`  
`.من الناصريه`  
`.من البصره`  
`.من الديوانيه`  
`.من الحله`  
`.من السماوه`  
`.من كربلاء`  
`.من النجف`  
`.من دبالى`  
`.من صلاح الدين`  
`.من كركوك`  
`.من الموصل`  
`.من سليمانيه`  
`.من دهوك`  
`.من اربيل`  
`.فعلي مميز`  
`.بوسهه`  
`.دز شدات`  
`.عرفني عليك`  
`.وانته`  
`.ها`  
`.شتريد`  
`.اني بنيه`  
`.اني بنيه لج`  
`.17`  
`.18`  
`.20`  
`.21`  
`.22`  
`.ها كبينه`  
`.وين مختفي`  
`.ثقفو`  
`.جبتك لحاله`  
`.ارجع للمطبخ`  
`.شلونكم`  
`.ليش`  
`.تعذرني`  
`.لا شكرا`  
`.باي حبيبي`  
`.غير مره`  
`.اكره ليرد متاخر`  
`.اكلك`  
`.عزه العزاك`  
`.جنك ماعاجبك`  
`.شكد سخيف`  
`.انت مطي`  
`.شكد تحمه`  
`.شكد فكر`  
`.شكد لطير`  
`.شكد فاهي`  
`.شكد غبي`  
`.شنو اسمج`  
`.شكرا`  
`.هلو كرار`  
`.امحح`  
`.كافي`  
`.ماتاكل خره`  
`.ايع`  
`.وي`  
`.انجب`  
`.فهمت لو لا`  
`.عادي`  
`.امحححح`  
`.هلو ابراهيم`  
`.هلو حيدر`  
`.هلو رضا`  
`.هلو مرتضى`  
`.هلو عمر`  
`.اخوي جفت`  
`.والله تمام`  
`.بخير تمام`  
`.الو السلام`  
`.انته طيري`  
`.وسام احبك`  
`.هلو سجاد`  
`.هلو باقر`  
`.هلو زيد`  
`.شدتسوي`  
`.ليش زعلت`  
`.شكد عمرك`  
`.شكد تحبني`  
`.ضفي النيه`  
`.ضحكه`  
`.شتريد يسولفون`  
`.بنيه تره`  
`.لتصير تافه`  
`.هلو عبد`  
`.هلو علي`  
`.هلو حسون`  
`.هلو حسين`  
`.هلو مصطفى`  
`.هلو احمد`  
`.شوف اغار`  
`.اغار عليك`  
`.غزل`  
`.وصخ`  
`.دي`  
`.اتسرسح`  
`.تحبيني`  
`.اموت عليك`  
`.ماريد اغلط`  
`.ماريد اهينك`  
`.ماريد اهينج`  
`.انجب`  
`.انجبي`  
`.انت المالك`  
`.ارفعني`  
`.تصبحون على خير`  
`.اجت فكره`  
`.تموت عل بنات`  
`.هلو مسلم`  
`.السلام`  
`.ممكن نتعرف`  
`.هاي انته`  
`.من وين`  
`.اشكد عمرك`  
`.انت مرتبط`  
`.من امت مرتبط`

╰───────⌯───────╯

انسخ أي بصمة تعجبك وارسلهة بالشات!
        """
    )
