from JoKeRUB import l313l
from ..core.managers import edit_or_reply

plugin_category = "بصمات البنات"

@l313l.ar_cmd(
    pattern="(بصمات|بصمات بنات|بصمات بنات السورس)$",
    command=("بصمات", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس",
        "الاستـخـدام": "{tr}بصمات أو {tr}بصمات بنات أو {tr}بصمات بنات السورس",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮

`هلا`  
`شلخبار`  
`شلونك`  
`شلونج`  
`نتعرف`  
`اني معجبه`  
`عجبني اراسلك`  
`نرتبط`  
`نتزوج`  
`ترا حبيتك`  
`هلكد ثكيل`  
`دز رصيد`  
`غنيله`  
`اريد رصيد`  
`ارشقلي`  
`ارشق قناتي`  
`ارشقلي حسابي`  
`سويلي تمويل`  
`دز صورتك`  
`دز ببجي`  
`دز لودو`  
`حساب انستا`  
`حساب تيك`  
`الو`  
`وينك`  
`وينج`  
`اي`  
`لا`  
`اكل خره`  
`اكلي خره`  
`يله`  
`شبيك`  
`شبيج`  
`احبج`  
`احبك`  
`تحبني`  
`انطي بوسه`  
`ابوسك`  
`احضنك`  
`اريدك بس الي`  
`ماكدر تصال`  
`ماحب لتصال`  
`هاي احسن`  
`يلا لتلح`  
`لا تلحين`  
`امداك`  
`امداج`  
`تمام`  
`هلو محمد`  
`باي`  
`مابيه شي`  
`شنو`  
`كول`  
`اكلج`  
`كولي`  
`مبي شحن`

╰───────⌯───────╯

انسخ أي بصمة تعجبك وارسلهة بالشات!
        """
    )
